БухЭксп/Documents/УведомлениеОСпецрежимахНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УведомлениеОСпецрежимахНалогообложения</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУведомленийОСпецрежимахНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеУведомления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВИФНС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантПризнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантФамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантОтчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеУведомления</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/CommonModules/НалогНаПрофессиональныйДоходВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("СформироватьУведомлениеОПереходеНаУСН", Истина);
	
КонецПроцедуры

Функция НавигацияПомощника(ВыбранныйРежим, Организация = Неопределено) Экспорт
	
	СтруктураНавигации = Новый Структура;
	СтруктураНавигации.Вставить(НавигацияПомощниковКлиентСервер.ИмяШага(1),
		СтруктураШагаНачало(1, Организация));
	
	СтруктураНавигации.Вставить(НавигацияПомощниковКлиентСервер.ИмяШага(2),
		СтруктураШагаЗаявление(2, ВыбранныйРежим, Организация));
	
	Если НалогНаПрофессиональныйДоходКлиентСервер.ПодаватьЗаявлениеПриУтратеПраваНПД(ВыбранныйРежим) Тогда
		СтруктураНавигации.Вставить(НавигацияПомощниковКлиентСервер.ИмяШага(3), СтруктураШагаДокументы(3, ВыбранныйРежим));
	КонецЕсли;
	
	Возврат СтруктураНавигации;
	
КонецФункции

// Формирует уведомление о переходе на УСН при утрате права на НПД
//
// Параметры:
//   ПараметрыВыполнения - Структура - см. НовыеПараметрыФормированияУведомленияОПереходеНаУСН()
//   АдресРезультата - Строка - Адрес результата выполнения процедуры
//
Процедура СформироватьУведомлениеОПереходеНаУСН(ПараметрыВыполнения, АдресРезультата = Неопределено) Экспорт
	
	Результат = Новый Структура("Заявление, Ошибка", , "");
	
	ДатаСоставления = ОбщегоНазначения.ТекущаяДатаПользователя();
	
	ПрименяетсяЕдиноеУведомлениеУСН = ДатаСоставления >= УчетУСНКлиентСервер.ДатаНачалаПримененияЕдиногоУведомленияУСН();
	
	ИмяОтчета = УчетУСНКлиентСервер.ИмяОтчетаУведомленияОПереходеНаУСН(ДатаСоставления, Истина);
	
	Если Не Отчеты[ИмяОтчета].ДанноеУведомлениеДоступноДляИП() Тогда
		ВызватьИсключение НСтр("ru = 'Уведомление о переходе на УСН с НПД недоступно для ИП.'");
	КонецЕсли;
	
	ИмяФормыПоУмолчанию = ИмяФормыУведомлениеПереходСНПД(ИмяОтчета);
	ИмяФормыУведомления = Сред(ИмяФормыПоУмолчанию, СтрНайти(ИмяФормыПоУмолчанию, ".Форма.") + 7);
	
	СозданноеУведомление = УведомлениеОПереходеНаУСНсНПД(ПараметрыВыполнения.Организация, ДатаСоставления, ИмяОтчета);
	
	Если ПрименяетсяЕдиноеУведомлениеУСН Тогда
		
		ДанныеЕдиногоУведомленияУСН = ДанныеЕдиногоУведомленияОПереходеНаУСН(
			ПараметрыВыполнения, ДатаСоставления, ИмяФормыУведомления);
		
		Если ТипЗнч(СозданноеУведомление) = Тип("Структура") И ЗначениеЗаполнено(СозданноеУведомление.Ссылка) Тогда
			ДанныеЕдиногоУведомленияУСН.Вставить("Ссылка", СозданноеУведомление.Ссылка);
		КонецЕсли;
		
		УведомлениеОПереходеНаУСН = Отчеты.РегламентированноеУведомлениеУСН.НовоеУведомлениеПоУСН(
			ДанныеЕдиногоУведомленияУСН);
		
		Результат.Заявление = УведомлениеОПереходеНаУСН;
		
	Иначе
		
		ДанныеУведомления = ДанныеУведомленияОПереходеНаУСН(ПараметрыВыполнения, ДатаСоставления);
		
		Если СозданноеУведомление = Неопределено Или Не ЗначениеЗаполнено(СозданноеУведомление.Ссылка) Тогда
			УведомлениеОбъект = Документы.УведомлениеОСпецрежимахНалогообложения.СоздатьДокумент();
		Иначе
			УведомлениеОбъект = СозданноеУведомление.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		УведомлениеОбъект.Организация = ПараметрыВыполнения.Организация;
		УведомлениеОбъект.ИмяФормы = ИмяФормыУведомления;
		УведомлениеОбъект.ИмяОтчета = "РегламентированноеУведомлениеПереходСНПД";
		УведомлениеОбъект.Дата = ДатаСоставления;
		УведомлениеОбъект.ДатаПодписи = ДатаСоставления;
		УведомлениеОбъект.ВидУведомления =
			НалогНаПрофессиональныйДоходКлиентСервер.ВидУведомленияПереходНПДУСН(ДатаСоставления);
		УведомлениеОбъект.РегистрацияВИФНС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ПараметрыВыполнения.Организация, "РегистрацияВНалоговомОргане");
		
		// Для представителя также необходимо заполнить реквизиты документы
		Если ЗначениеЗаполнено(ПараметрыВыполнения.Представитель) Тогда
			ФИОПредставителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				ПараметрыВыполнения.Представитель, "Фамилия, Имя, Отчество");
			УведомлениеОбъект.ПодписантФамилия = ФИОПредставителя.Фамилия;
			УведомлениеОбъект.ПодписантИмя = ФИОПредставителя.Имя;
			УведомлениеОбъект.ПодписантОтчество = ФИОПредставителя.Отчество;
		Иначе
			УведомлениеОбъект.ПодписантФамилия = ДанныеУведомления.ДанныеУведомления.Титульная.Фамилия;
			УведомлениеОбъект.ПодписантИмя = ДанныеУведомления.ДанныеУведомления.Титульная.Имя;
			УведомлениеОбъект.ПодписантОтчество = ДанныеУведомления.ДанныеУведомления.Титульная.Отчество;
		КонецЕсли;
		
		УведомлениеОбъект.ДанныеУведомления = Новый ХранилищеЗначения(ДанныеУведомления);
		
		Попытка
			УведомлениеОбъект.Записать();
			УведомлениеОПереходеНаУСН = УведомлениеОбъект.Ссылка;
			Результат.Заявление = УведомлениеОПереходеНаУСН;
		Исключение
			УведомлениеОПереходеНаУСН = Неопределено;
			Результат.Ошибка = ОписаниеОшибки();
		КонецПопытки;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УведомлениеОПереходеНаУСН) Тогда
		ИнтерфейсыВзаимодействияБРО.СохранитьСтатусОтправкиУведомления(
			УведомлениеОПереходеНаУСН,
			ИнтерфейсыВзаимодействияБРОКлиентСервер.СтатусПодготовленоСтрокой());
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

// Возвращает созданное уведомление о переходе на УСН с НПД
//
// Параметры:
//   Организация - СправочникСсылка.Организации - Организация, для которой необходимо найти уведомление о переходе на УСН с НПД
//   ДатаСоставления - Дата - Дата составления уведомления
//   ИмяОтчета - Строка - Имя регламентированного отчета
//
// Возвращаемое значение:
//   ДокументСсылка.УведомлениеОСпецрежимахНалогообложения - Документ с видом УведомлениеПереходНПДУСН
//
Функция УведомлениеОПереходеНаУСНсНПД(Организация, ДатаСоставления = Неопределено, ИмяОтчета = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаСоставления) Тогда
		ДатаСоставления = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяОтчета) Тогда
		ИмяОтчета = УчетУСНКлиентСервер.ИмяОтчетаУведомленияОПереходеНаУСН(ДатаСоставления, Истина);
	КонецЕсли;
	
	Если Не Отчеты[ИмяОтчета].ДанноеУведомлениеДоступноДляИП() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УведомлениеОСпецРежимеНалогообложения = Обработки.РегистрацияОрганизации.НайтиУведомлениеОСпецРежимеНалогообложения(
		Организация,
		НалогНаПрофессиональныйДоходКлиентСервер.ВидУведомленияПереходНПДУСН(ДатаСоставления),
		ИмяФормыУведомлениеПереходСНПД(ИмяОтчета));
	
	Возврат УведомлениеОСпецРежимеНалогообложения;
	
КонецФункции

// Формирует уведомление о переходе на УСН с НПД
//
// Параметры:
//   Организация             - СправочникСсылка.Организации - Организация, для которой необходимо найти уведомление о переходе на УСН с НПД
//   УникальныйИдентификатор - УникальныйИдентификатор - Уникальный идентификатор формы
//   ВыбранныйРежим          - Строка - УСНДоходыИП или УСНДоходыРасходыИП
//   ДанныеПредставителя     - Структура - См. НалогНаПрофессиональныйДоходКлиентСервер.НовыеДанныеПредставителя()
//
// Возвращаемое значение:
// Структура - см. ДлительныеОперации.ВыполнитьВФоне
//
Функция СформироватьУведомлениеОПереходеНаУСНВФоне(Организация, УникальныйИдентификатор, ВыбранныйРежим, ДанныеПредставителя = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование уведомления о переходе на УСН при утрате права на НПД'");
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	
	ПараметрыФормированияДокументов = НовыеПараметрыФормированияУведомленияОПереходеНаУСН();
	ПараметрыФормированияДокументов.Организация = Организация;
	ПараметрыФормированияДокументов.ВыбранныйРежим = ВыбранныйРежим;
	
	Если ДанныеПредставителя <> Неопределено Тогда
		ПараметрыФормированияДокументов.Представитель = ДанныеПредставителя.Представитель;
		ПараметрыФормированияДокументов.ДокументПредставителя = ДанныеПредставителя.ДокументПредставителя;
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("НалогНаПрофессиональныйДоходВызовСервера.СформироватьУведомлениеОПереходеНаУСН",
		ПараметрыФормированияДокументов,
		НастройкиЗапуска);
	
КонецФункции

// Возвращает сумму доходов организации на НПД за выбранный период.
// Учитываются только доходы, полученные по банку и по кассе по данным бухгалтерского учета.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации
//  НачалоПериода - Дата - начало периода
//  КонецПериода - Дата - конец периода
// 
// Возвращаемое значение:
//  Число - сумма доходов за период
//
Функция СуммаДоходов(Организация, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ЧекиНПД.СуммаЧека), 0) КАК Доходы
	|ИЗ
	|	РегистрСведений.ЧекиНПД КАК ЧекиНПД
	|ГДЕ
	|	ЧекиНПД.Организация = &Организация
	|	И ЧекиНПД.ДатаЧека МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЧекиНПД.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЧековНПД.Зарегистрирован)";
	
	Возврат Запрос.Выполнить().Выгрузить()[0].Доходы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураШагаНачало(НомерШага, Организация = Неопределено)
	
	СтруктураШага                = НоваяСтруктураШага();
	СтруктураШага.ИмяПомощника   = ИмяПомощникаУтратаПраваНПД();
	СтруктураШага.НомерШага      = НомерШага;
	СтруктураШага.ТекстНавигации = НСтр("ru='Налоги'");
	СтруктураШага.СтруктураПараметровФормы.НавигацияПараметрФормы = "Налоги";
	СтруктураШага.ИмяФормы = "Обработка.СравнениеРежимовНалогообложения.Форма.Форма";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		СтруктураШага.СтруктураПараметровФормы.Вставить("Организация", Организация);
	КонецЕсли;
	
	Возврат СтруктураШага;
	
КонецФункции

Функция СтруктураШагаЗаявление(НомерШага, ВыбранныйРежим, Организация)
	
	СтруктураШага                = НоваяСтруктураШага();
	СтруктураШага.ИмяПомощника   = ИмяПомощникаУтратаПраваНПД();
	СтруктураШага.НомерШага      = НомерШага;
	СтруктураШага.ТекстНавигации = НСтр("ru='Заявление'");
	СтруктураШага.СтруктураПараметровФормы.НавигацияПараметрФормы = "Заявление";
	
	Если ВыбранныйРежим = "ПСНИП" Тогда
		СтруктураШага.ИмяФормы = "Обработка.ПомощникЗаполненияЗаявленияНаПолучениеПатента.Форма.Форма";
	Иначе
		СтруктураШага.ИмяФормы = "Обработка.СравнениеРежимовНалогообложения.Форма.Форма";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		СтруктураШага.СтруктураПараметровФормы.Вставить("Организация", Организация);
	КонецЕсли;
	
	Возврат СтруктураШага;
	
КонецФункции

Функция СтруктураШагаДокументы(НомерШага, ВыбранныйРежим)
	
	СтруктураШага                = НоваяСтруктураШага();
	СтруктураШага.ИмяПомощника   = ИмяПомощникаУтратаПраваНПД();
	СтруктураШага.НомерШага      = НомерШага;
	СтруктураШага.ТекстНавигации = НСтр("ru='Документы'");
	СтруктураШага.СтруктураПараметровФормы.НавигацияПараметрФормы = "Документы";
	
	Если ВыбранныйРежим = "ПСНИП" Тогда
		СтруктураШага.ИмяФормы = "Обработка.ПомощникЗаполненияЗаявленияНаПолучениеПатента.Форма.Форма";
	Иначе
		СтруктураШага.ИмяФормы = "Обработка.СравнениеРежимовНалогообложения.Форма.Форма";
	КонецЕсли;
	
	Возврат СтруктураШага;
	
КонецФункции

Функция НоваяСтруктураШага()
	
	СтруктураШага = НавигацияПомощников.НовыйСтруктураШага();
	СтруктураШага.СтруктураПараметровФормы.Вставить("УтратаПраваНПД", Истина);
	
	Возврат СтруктураШага;
	
КонецФункции

Функция ИмяПомощникаУтратаПраваНПД()

	Возврат "УтратаПраваНПД";

КонецФункции

Функция ДанныеЕдиногоУведомленияОПереходеНаУСН(ПараметрыВыполнения, ДатаСоставления, ИмяФормыУведомления)
	
	ДанныеУведомления = Новый Структура;
	ПараметрыОтчета = Новый Структура;
	ПараметрыЗаполнения = Новый Структура;
	
	ДанныеУведомления.Вставить("ИмяФормы", ИмяФормыУведомления);
	
	ДанныеУведомления.Вставить("Организация", ПараметрыВыполнения.Организация);
	ПараметрыОтчета.Вставить("Организация", ПараметрыВыполнения.Организация);
	
	РегистрацияВИФНС = Справочники.Организации.РегистрацияВНалоговомОрганеНаДату(
		ПараметрыВыполнения.Организация, ДатаСоставления);
	ДанныеУведомления.Вставить("РегистрацияВИФНС", РегистрацияВИФНС);
	
	ПараметрыЗаполнения.Вставить("ДатаСоставления", ДатаСоставления);
	ПараметрыЗаполнения.Вставить("ЭтоПереходНаУСНсНПД", Истина);
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.Представитель) Тогда
		ФИОПредставителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ПараметрыВыполнения.Представитель, "Фамилия, Имя, Отчество");
		ДанныеУведомления.Вставить("ПодписантФамилия", ФИОПредставителя.Фамилия);
		ДанныеУведомления.Вставить("ПодписантИмя", ФИОПредставителя.Имя);
		ДанныеУведомления.Вставить("ПодписантОтчество", ФИОПредставителя.Отчество);
		
		ПодписантФИО = СтрШаблон("%1 %2 %3", ФИОПредставителя.Фамилия, ФИОПредставителя.Имя, ФИОПредставителя.Отчество);
		
		ПараметрыЗаполнения.Вставить("ПодписываетНалогоплательщик", Ложь);
		ПараметрыЗаполнения.Вставить("ПодписантФИО", ПодписантФИО);
		ПараметрыЗаполнения.Вставить("ДокументПредставителя", ПараметрыВыполнения.ДокументПредставителя);
	Иначе
		СтрокаРеквизитыИП = "ФамилияИП,ИмяИП,ОтчествоИП";
		РеквизитыИП = СтрРазделить(СтрокаРеквизитыИП, ",", Ложь);
		СведенияИП = РегламентированнаяОтчетностьПереопределяемый.ПолучитьСведенияОбОрганизации(
			ПараметрыВыполнения.Организация, ДатаСоставления, РеквизитыИП);
		ДанныеУведомления.Вставить("ПодписантФамилия", СведенияИП.ФамилияИП);
		ДанныеУведомления.Вставить("ПодписантИмя", СведенияИП.ИмяИП);
		ДанныеУведомления.Вставить("ПодписантОтчество", СведенияИП.ОтчествоИП);
		
		ПодписантФИО = СтрШаблон("%1 %2 %3", СведенияИП.ФамилияИП, СведенияИП.ИмяИП, СведенияИП.ОтчествоИП);
		
		ПараметрыЗаполнения.Вставить("ПодписываетНалогоплательщик", Истина);
		ПараметрыЗаполнения.Вставить("ПодписантФИО", ПодписантФИО);
	КонецЕсли;
	
	ПараметрыЗаполнения.Вставить("ВыбранныйРежим", ПараметрыВыполнения.ВыбранныйРежим);
	
	ПараметрыОтчета.Вставить("ПараметрыЗаполнения", ПараметрыЗаполнения);
	ДанныеУведомления.Вставить("ПараметрыОтчета", ПараметрыОтчета);
	
	Возврат ДанныеУведомления;
	
КонецФункции

Функция ДанныеУведомленияОПереходеНаУСН(ПараметрыВыполнения, ДатаСоставления)
	
	Результат = Новый Структура("ДанныеУведомления, ДеревоСтраниц, РазрешитьВыгружатьСОшибками");
	
	ДанныеУведомления = НовыйСтруктураДанныеУведомленияОПереходеНаУСН();
	
	РеквизитыИП = Новый Массив;
	РеквизитыИП.Добавить("ФИО");
	РеквизитыИП.Добавить("ФамилияИП");
	РеквизитыИП.Добавить("ИмяИП");
	РеквизитыИП.Добавить("ОтчествоИП");
	РеквизитыИП.Добавить("ИННФЛ");
	РеквизитыИП.Добавить("ТелСлуж");
	РеквизитыИП.Добавить("КодНО");
	
	СведенияОбОрганизации = РегламентированнаяОтчетностьПереопределяемый.ПолучитьСведенияОбОрганизации(
		ПараметрыВыполнения.Организация,
		ДатаСоставления,
		РеквизитыИП);
	
	ДанныеУведомления.ДАТА_ПОДПИСИ = ДатаСоставления;
	ДанныеУведомления.ИНН = СведенияОбОрганизации.ИННФЛ;
	ДанныеУведомления.Фамилия = СведенияОбОрганизации.ФамилияИП;
	ДанныеУведомления.Имя = СведенияОбОрганизации.ИмяИП;
	ДанныеУведомления.Отчество = СведенияОбОрганизации.ОтчествоИП;
	ДанныеУведомления.КодНО = СведенияОбОрганизации.КодНО;
	ДанныеУведомления.Тлф = СведенияОбОрганизации.ТелСлуж;
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.Представитель) Тогда
		ДанныеУведомления.ПРИЗНАК_НП_ПОДВАЛ = "2"; // Представитель
		ДанныеУведомления.ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ = ПараметрыВыполнения.Представитель;
		ДанныеУведомления.НаимДок = ПараметрыВыполнения.ДокументПредставителя;
	Иначе
		ДанныеУведомления.ПРИЗНАК_НП_ПОДВАЛ = "1"; // Предприниматель
		ДанныеУведомления.ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ = СведенияОбОрганизации.ФИО;
	КонецЕсли;
	
	Если ПараметрыВыполнения.ВыбранныйРежим = "УСНДоходыИП" Тогда
		ДанныеУведомления.ПрОбНал = "1"; // УСН доходы
	Иначе
		ДанныеУведомления.ПрОбНал = "2"; // УСН доходы - расходы
	КонецЕсли;
	
	Результат.ДанныеУведомления = Новый Структура;
	Результат.ДанныеУведомления.Вставить("Титульная", ДанныеУведомления);
	Результат.РазрешитьВыгружатьСОшибками = Ложь;
	Результат.ДеревоСтраниц = Отчеты.РегламентированноеУведомлениеПереходСНПД.СформироватьПустоеДеревоСтраниц_2020(
		НалогНаПрофессиональныйДоходКлиентСервер.ВидУведомленияПереходНПДУСН(ДатаСоставления));
	
	Возврат Результат;
	
КонецФункции

Функция НовыйСтруктураДанныеУведомленияОПереходеНаУСН()
	
	Результат = Новый Структура;
	Результат.Вставить("ВсегоСтраниц", 0);
	Результат.Вставить("ДАТА_ПОДПИСИ", '00010101');
	Результат.Вставить("ИНН", "");
	Результат.Вставить("Имя", "");
	Результат.Вставить("КодНО", "");
	Результат.Вставить("НаимДок", "");
	Результат.Вставить("НаимОргПред", "");
	Результат.Вставить("Отчество", "");
	Результат.Вставить("ПРИЗНАК_НП_ПОДВАЛ", ""); // 1 - Налогоплательщик, 2 - Представитель
	Результат.Вставить("ПрОбНал", ""); // 1 - Доходы, 2 - Доходы - расходы
	Результат.Вставить("ПрПерехУСН", "1"); // Переход на УСН с НПД
	Результат.Вставить("Тлф", "");
	Результат.Вставить("ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ", "");
	Результат.Вставить("Фамилия", "");
	
	Возврат Результат;
	
КонецФункции

// Возвращает параметры формирования уведомления о перерходе на УСН при утрате права на НПД
//
// Возвращаемое значение:
//   Структура
//
Функция НовыеПараметрыФормированияУведомленияОПереходеНаУСН()
	
	Результат = Новый Структура;
	Результат.Вставить("Организация");
	Результат.Вставить("ВыбранныйРежим", ""); // УСНДоходыИП, УСНДоходыРасходыИП
	Результат.Вставить("Представитель", "");
	Результат.Вставить("ДокументПредставителя", "");
	
	Возврат Результат;
	
КонецФункции

// Возвращает действующее имя формы уведомления о переходе на УСН и НПД
//
// Параметры:
//   ИмяОтчета - Строка - имя регламентированного отчета
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяФормыУведомлениеПереходСНПД(ИмяОтчета)
	
	Возврат РегламентированнаяОтчетностьБП.ПолноеИмяФормыПоУмолчанию(ИмяОтчета);
	
КонецФункции

#КонецОбласти
